{
  "translation": {
    "home": "Inicio",
    "about": "Acerca de",
    "educationBar": "Educaci칩n",
    "skills": "Habilidades",
    "projectsBar": "Proyectos",
    "contact": "Contacto",
    "greeting": "Hola <span style='font-size: 1.2em'>游녦</span>, soy <strong>{{name}}</strong>",
    "subtitle": "Estudiante de maestr칤a en Ingenier칤a de Software en <br/><strong>{{university}}</strong>",
    "resume": "Obtener Curr칤culum",
    "I CONSTANTLY TRY TO IMPROVE": "SIEMPRE TRATO DE MEJORAR",
    "My Educational Path": "Mi Trayectoria Educativa",
    "MY TECH STACK": "MI PILA TECNOL칍GICA",
    "More About Me": "M치s Sobre M칤",
    "about1": "Soy estudiante de maestr칤a con una gran pasi칩n por los proyectos personales. Me gradu칠 con una licenciatura de la Universidad de Palermo, donde trabaj칠 en varios proyectos universitarios que me permitieron colaborar en equipos y desarrollar habilidades de comunicaci칩n, incluso con personas de todo el mundo. Adem치s, dediqu칠 tiempo a proyectos personales para expandir mis conocimientos y habilidades.",
    "about2": "Cuando no estoy programando, me concentro en mantenerme actualizado con las 칰ltimas tecnolog칤as y en el crecimiento personal. Tambi칠n disfruto trabajando con electr칩nica.",
    "about3": "Tambi칠n he contribuido a un proyecto de c칩digo abierto, lo que me ayud칩 a comprender la importancia de trabajar con grandes bases de c칩digo y revisar el c칩digo escrito por otros.",
    "A Student with High Attention to Personal Projects": "Un Estudiante con Alta Atenci칩n a los Proyectos Personales",
    "Projects": "Proyectos",
    "Submit": "Enviar",
    "Your email": "Tu correo electr칩nico",
    "Your Message": "Tu mensaje",
    "ContactTitle": "Cont치ctame",
    "contactSubtitle": "Por favor cont치ctame directamente a\n                        <a href=\"mailto:giuseppebarone2028@gmail.com\" style={{ textDecoration: \"none\"}}>\n                            giuseppebarone2028@gmail.com\n                        </a>\n                        o a trav칠s de este formulario.",
    "skillData": [
      { "name": "HTML", "icon": "/skillimages/html.svg", "description": "Lenguaje de marcado utilizado para estructurar p치ginas web." },
      { "name": "CSS", "icon": "/skillimages/css.svg", "description": "Lenguaje de hojas de estilo utilizado para definir la apariencia y el dise침o de p치ginas web." },
      { "name": "JavaScript", "icon": "/skillimages/javascript.svg", "description": "Lenguaje de secuencias de comandos utilizado para hacer que las p치ginas web sean interactivas y din치micas." },
      { "name": "TypeScript", "icon": "/skillimages/typescript.svg", "description": "Superconjunto de JavaScript que agrega soporte de tipado est치tico, mejorando el mantenimiento del c칩digo." },
      { "name": "ReactJS", "icon": "/skillimages/react.svg", "description": "Biblioteca de JavaScript para construir interfaces de usuario reactivas basadas en componentes." },
      { "name": "NodeJS", "icon": "/skillimages/nodejs.svg", "description": "Entorno de ejecuci칩n de JavaScript para desarrollo en el lado del servidor, basado en el motor V8." },
      { "name": "ExpressJS", "icon": "/skillimages/express.svg", "description": "Framework minimalista de Node.js que simplifica la creaci칩n de API y servidores web." },
      { "name": "Rust", "icon": "/skillimages/rust.svg", "description": "Lenguaje de programaci칩n moderno y seguro ideal para el desarrollo de sistemas de alto rendimiento." },
      { "name": "MongoDB", "icon": "/skillimages/mongodb.svg", "description": "Base de datos NoSQL orientada a documentos utilizada para manejar grandes vol칰menes de datos flexibles." },
      { "name": "MySQL", "icon": "/skillimages/mysql.svg", "description": "Sistema de gesti칩n de bases de datos relacional (RDBMS) utilizado ampliamente en aplicaciones web y software empresarial." },
      { "name": "PostgreSQL", "icon": "/skillimages/postgresql.svg", "description": "Base de datos relacional avanzada de c칩digo abierto con soporte para operaciones SQL complejas." },
      { "name": "SQLite", "icon": "/skillimages/sqlite.svg", "description": "Motor de base de datos SQL ligero y aut칩nomo com칰nmente utilizado en sistemas embebidos y aplicaciones peque침as." },
      { "name": "Android", "icon": "/skillimages/android.svg", "description": "Sistema operativo m칩vil desarrollado por Google, utilizado para crear aplicaciones m칩viles." },
      { "name": "Arduino", "icon": "/skillimages/arduino.svg", "description": "Plataforma de hardware y software de c칩digo abierto para crear proyectos electr칩nicos interactivos." },
      { "name": "Bootstrap", "icon": "/skillimages/bootstrap.svg", "description": "Framework de CSS que simplifica la creaci칩n de interfaces web modernas y responsivas." },
      { "name": "Flask", "icon": "/skillimages/flask.svg", "description": "Micro-framework ligero de Python para construir aplicaciones web escalables." },
      { "name": "Flutter", "icon": "/skillimages/flutter.svg", "description": "Framework de UI desarrollado por Google para crear aplicaciones nativas para m칩vil, web y escritorio." },
      { "name": "Java", "icon": "/skillimages/java.svg", "description": "Lenguaje de programaci칩n vers치til utilizado para el desarrollo de aplicaciones empresariales, m칩viles y web." },
      { "name": "Kotlin", "icon": "/skillimages/kotlin.svg", "description": "Lenguaje de programaci칩n moderno y conciso preferido para el desarrollo de Android." },
      { "name": "Python", "icon": "/skillimages/python.svg", "description": "Lenguaje de programaci칩n vers치til y f치cil de aprender utilizado en desarrollo web, inteligencia artificial y automatizaci칩n." },
      { "name": "GraphQL", "icon": "/skillimages/graphql.svg", "description": "Lenguaje de consulta para API que permite obtener datos precisos de manera m치s eficiente que REST." },
      { "name": "Sonar Cloud", "icon": "/skillimages/sonarcloud.svg", "description": "Herramienta de an치lisis de c칩digo que ayuda a mejorar la calidad y seguridad del software." },
      { "name": "socketIO", "icon": "/skillimages/socket.io.svg", "description": "Biblioteca de JavaScript para la comunicaci칩n en tiempo real entre el cliente y el servidor usando WebSockets." },
      { "name": "Git", "icon": "/skillimages/git.svg", "description": "Sistema de control de versiones distribuido utilizado para la gesti칩n y colaboraci칩n en c칩digo fuente." }
    ],
    "projects": [
      {
        "name": "Softwork",
        "images": ["projectImage/p1/img1.png", "projectImage/p1/img2.png", "projectImage/p1/img3.png"],
        "madeWith": [
          { "name": "MySQL", "icon": "/skillimages/mysql.svg" },
          { "name": "Java", "icon": "/skillimages/java.svg" }
        ],
        "description": "Proyecto desarrollado para el curso de Ingenier칤a de Software, durante la licenciatura en Ingenier칤a Inform치tica. Este software, construido utilizando el marco JavaFX, permite gestionar los turnos de toda una empresa. Cada empleado puede registrar su entrada y salida en diferentes terminales ubicados por la empresa.",
        "link": ["https://github.com/giuseppe2028/ProgettoCompleto"]
      },
      {
        "name": "MiSvaGo",
        "images": ["projectImage/p2/img1.png", "projectImage/p2/img2.png", "projectImage/p2/img3.png"],
        "madeWith": [
          { "name": "Android", "icon": "/skillimages/android.svg" },
          { "name": "Kotlin", "icon": "/skillimages/kotlin.svg" },
          { "name": "SQLite", "icon": "/skillimages/sqlite.svg" }
        ],
        "description": "Proyecto desarrollado para una aplicaci칩n de reservas de paquetes tur칤sticos. Este proyecto fue desarrollado usando Kotlin y XML, con Retrofit para llamadas HTTP.",
        "link": "https://github.com/giuseppe2028/ProgettoPWM.git"
      },
      {
        "name": "What Do You Meme",
        "images": ["projectImage/p3/img1.png", "projectImage/p3/img2.png"],
        "madeWith": [
          { "name": "Bootstrap", "icon": "/skillimages/bootstrap.svg" },
          { "name": "CSS", "icon": "/skillimages/css.svg" },
          { "name": "HTML", "icon": "/skillimages/html.svg" },
          { "name": "JavaScript", "icon": "/skillimages/javascript.svg" },
          { "name": "React", "icon": "/skillimages/react.svg" },
          { "name": "SQLite", "icon": "/skillimages/sqlite.svg" },
          { "name": "Express", "icon": "/skillimages/express.svg" }
        ],
        "description": "Proyecto desarrollado para el curso WebApp1. Este proyecto fue desarrollado tanto con un backend como un frontend. El backend fue creado con Node, Express y JavaScript, mientras que el frontend us칩 React, Bootstrap y JavaScript.",
        "link": "https://github.com/giuseppe2028/meme_game.git"
      }
    ],
    "education": [
      {
        "name": "M치ster en Ciencias de la Computaci칩n en Polit칠cnico de Torino",
        "date": "2023-Hoy",
        "logo": "/formazione/logo_polito.png",
        "description": "En este curso, he tomado varias clases que me ayudaron a crecer profesionalmente, trabajando en varios proyectos con equipos internacionales. Estudi칠 sistemas distribuidos a fondo, as칤 como tecnolog칤as DevOps y 치giles."
      },
      {
        "name": "Licenciatura en Ciencias de la Computaci칩n en la Universidad de Palermo",
        "date": "2020-2023",
        "logo": "/formazione/logo_unipa.png",
        "description": "Durante este grado, pas칠 por m칰ltiples etapas, comenzando con materias de ingenier칤a como electr칩nica y an치lisis, y pasando a materias m치s enfocadas en TI como Java, MySQL, Android y Kotlin. Tambi칠n tuve la oportunidad de trabajar en varios equipos durante distintos proyectos."
      }
    ],
    "Madewith": "Hecho con:"
  }

}