{
  "skillData": [
    { "name": "HTML", "icon": "/skillimages/html.svg", "description": "Markup language used to structure web pages." },
    { "name": "CSS", "icon": "/skillimages/css.svg", "description": "Style sheet language used to define the appearance and layout of web pages." },
    { "name": "JavaScript", "icon": "/skillimages/javascript.svg", "description": "Scripting language used to make web pages interactive and dynamic." },
    { "name": "TypeScript", "icon": "/skillimages/typescript.svg", "description": "Superset of JavaScript that adds static typing support, improving code maintainability." },
    { "name": "ReactJS", "icon": "/skillimages/react.svg", "description": "JavaScript library for building reactive, component-based user interfaces." },
    { "name": "NodeJS", "icon": "/skillimages/nodejs.svg", "description": "JavaScript runtime environment for server-side development, based on the V8 engine." },
    { "name": "ExpressJS", "icon": "/skillimages/express.svg", "description": "Minimalist Node.js framework that simplifies API and web server creation." },
    { "name": "Rust", "icon": "/skillimages/rust.svg", "description": "Modern, safe programming language ideal for high-performance system development." },
    { "name": "MongoDB", "icon": "/skillimages/mongodb.svg", "description": "NoSQL document-oriented database used for handling large volumes of flexible data." },
    { "name": "MySQL", "icon": "/skillimages/mysql.svg", "description": "Relational database management system (RDBMS) widely used for web applications and enterprise software." },
    { "name": "PostgreSQL", "icon": "/skillimages/postgresql.svg", "description": "Advanced open-source relational database with support for complex SQL operations." },
    { "name": "SQLite", "icon": "/skillimages/sqlite.svg", "description": "Lightweight, self-contained SQL database engine commonly used for embedded systems and small applications." },
    { "name": "Android", "icon": "/skillimages/android.svg", "description": "Mobile operating system developed by Google, used for building mobile applications." },
    { "name": "Arduino", "icon": "/skillimages/arduino.svg", "description": "Open-source hardware and software platform for creating interactive electronics projects." },
    { "name": "Bootstrap", "icon": "/skillimages/bootstrap.svg", "description": "CSS framework that simplifies the creation of responsive and modern web interfaces." },
    { "name": "Flask", "icon": "/skillimages/flask.svg", "description": "Lightweight Python micro-framework for building scalable web applications." },
    { "name": "Flutter", "icon": "/skillimages/flutter.svg", "description": "UI framework developed by Google for creating native apps on mobile, web, and desktop." },
    { "name": "Java", "icon": "/skillimages/java.svg", "description": "Versatile programming language widely used for enterprise, mobile, and web development." },
    { "name": "Kotlin", "icon": "/skillimages/kotlin.svg", "description": "Modern and concise programming language preferred for Android development." },
    { "name": "Python", "icon": "/skillimages/python.svg", "description": "Versatile and easy-to-learn programming language used in web development, AI, and automation." },
    { "name": "GraphQL", "icon": "/skillimages/graphql.svg", "description": "Query language for APIs that enables fetching precise data in a more efficient way compared to REST." },
    { "name": "Sonar Cloud", "icon": "/skillimages/sonarcloud.svg", "description": "Code analysis tool that helps improve software quality and security." },
    { "name": "socketIO", "icon": "/skillimages/socket.io.svg", "description": "JavaScript library for real-time communication between client and server using WebSockets." },
    { "name": "Git", "icon": "/skillimages/git.svg", "description": "Distributed version control system used for source code management and collaboration." }
  ],
  "projects": [
    {
      "name": "Softwork",
      "images": ["projectImage/p1/img1.png","projectImage/p1/img2.png","projectImage/p1/img3.png"],
      "madeWith": [
        { "name": "MySQL", "icon": "/skillimages/mysql.svg" },
        { "name": "Java", "icon": "/skillimages/java.svg" }
      ],
      "description": "Progetto realizzato per la materia Ingegneria del software, all'interno del percosrso di studi trienale di ingegneria informatica. All'interno di questo software, costruti attraverso il framewok javafx, è possibile gestire i turni di un'intera azienda. Ogni dipendente può timbrare un'entrata ed un'uscita all'iterno di altri termiali disposti all'interno dell'azienda.",
      "links": ["github"]
    },
    {
      "name": "MiSvaGo",
      "images": ["projectImage/p2/img1.png","projectImage/p2/img2.png","projectImage/p2/img3.png"],
      "madeWith": [
        { "name": "Android", "icon": "/skillimages/android.svg" },
        { "name": "Kotlin", "icon": "/skillimages/kotlin.svg" },
        { "name": "Sqlite", "icon": "/skillimages/sqlite.svg" }
      ],
      "description": "Progetto realizzato per la realizzazioen di un'applicazione di acquisto pacchetti viaggi. Tale progetto è stato sviluppato con l'ausilio di Kotlin e XML, e retrofit per le chiamate HTPP.",
      "link": "github"
    },{
      "name": "What Do You Meme",
      "images": ["projectImage/p3/img1.png","projectImage/p3/img2.png"],
      "madeWith": [
        { "name": "Bootstrap", "icon": "/skillimages/bootstrap.svg" },
        { "name": "CSS", "icon": "/skillimages/css.svg" },
        { "name": "HTML", "icon": "/skillimages/html.svg" },
        { "name": "Javascript", "icon": "/skillimages/javascript.svg" },
        { "name": "React", "icon": "/skillimages/react.svg" },
        { "name": "SQLite", "icon": "/skillimages/sqlite.svg" },
        { "name": "Express", "icon": "/skillimages/express.svg" }
      ],
      "description": "Progetto realizzato per il corso di webapp1. Tale progetto è stato realizzato con un backend e un frontend. Il back-end è stato realizzato utilizzando react, bootstrap e javascript per il front-end, e node, express e javascript per il back-end.",
      "link": "github"
    }

  ],
  "education": [
    {
      "name": "Master degree in Computer science at Politection di Torino",
      "date": "2023-Today",
      "logo": "/formazione/logo_polito.png",
      "description": "In questo percorso ho affrontato diversi corsi che mi hanno aiutato a crescere professionalmente, mettendo di fronte a diversi progetti, con team internazionali. Approfondendo in modo accurato i sistemi distributi, e le tecnologie di devops e agile."
    },
    {
      "name": "Bachelor degree in Computer science at Università degli studi di Palermo",
      "date": "2020-2023",
      "logo": "/formazione/logo_unipa.png",
      "description": "In questo percorso di studi ho affrontato diversi step, partendo da quelli ingegneristici, come l'elettronica, e analisi, fino a quelli più informatici, come Java, Mysql, android e Kotlin. Dando la possibilità di prendere parte a diversi team durante i progetti."
    }
  ]
}